# Задача 1. Однострочный код
# Пользователь вводит неопределённое количество чисел. Напишите код, который запрашивает эти числа и сортирует их по возрастанию. Реализуйте решение в одну строку.




Задача 2. Однострочный код 2
Пользователь вводит строку, состоящую из любых символов. Напишите код, который выводит на экран список этих символов, исключая цифры и буквы в верхнем регистре.



Задача 3. Функция reduce
Помимо map и filter, есть ещё одна функция — reduce. Она применяет указанную функцию к элементам последовательности, сводя её к единственному значению. Однако используют reduce довольно редко. Начиная с третьей версии Python, эту функцию даже вынесли из встроенных функций в модуль functools.

